bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/ethmac_reg.h
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
 #ifndef  __ETHMAC_REG_H__
 #define  __ETHMAC_REG_H__

#include "bl808.h"

/* 0x0 : MODE */
#define ETHMAC_MODE_OFFSET                                      (0x0)
#define ETHMAC_RXEN                                             ETHMAC_RXEN
#define ETHMAC_RXEN_POS                                         (0U)
#define ETHMAC_RXEN_LEN                                         (1U)
#define ETHMAC_RXEN_MSK                                         (((1U<<ETHMAC_RXEN_LEN)-1)<<ETHMAC_RXEN_POS)
#define ETHMAC_RXEN_UMSK                                        (~(((1U<<ETHMAC_RXEN_LEN)-1)<<ETHMAC_RXEN_POS))
#define ETHMAC_TXEN                                             ETHMAC_TXEN
#define ETHMAC_TXEN_POS                                         (1U)
#define ETHMAC_TXEN_LEN                                         (1U)
#define ETHMAC_TXEN_MSK                                         (((1U<<ETHMAC_TXEN_LEN)-1)<<ETHMAC_TXEN_POS)
#define ETHMAC_TXEN_UMSK                                        (~(((1U<<ETHMAC_TXEN_LEN)-1)<<ETHMAC_TXEN_POS))
#define ETHMAC_NOPRE                                            ETHMAC_NOPRE
#define ETHMAC_NOPRE_POS                                        (2U)
#define ETHMAC_NOPRE_LEN                                        (1U)
#define ETHMAC_NOPRE_MSK                                        (((1U<<ETHMAC_NOPRE_LEN)-1)<<ETHMAC_NOPRE_POS)
#define ETHMAC_NOPRE_UMSK                                       (~(((1U<<ETHMAC_NOPRE_LEN)-1)<<ETHMAC_NOPRE_POS))
#define ETHMAC_BRO                                              ETHMAC_BRO
#define ETHMAC_BRO_POS                                          (3U)
#define ETHMAC_BRO_LEN                                          (1U)
#define ETHMAC_BRO_MSK                                          (((1U<<ETHMAC_BRO_LEN)-1)<<ETHMAC_BRO_POS)
#define ETHMAC_BRO_UMSK                                         (~(((1U<<ETHMAC_BRO_LEN)-1)<<ETHMAC_BRO_POS))
#define ETHMAC_PRO                                              ETHMAC_PRO
#define ETHMAC_PRO_POS                                          (5U)
#define ETHMAC_PRO_LEN                                          (1U)
#define ETHMAC_PRO_MSK                                          (((1U<<ETHMAC_PRO_LEN)-1)<<ETHMAC_PRO_POS)
#define ETHMAC_PRO_UMSK                                         (~(((1U<<ETHMAC_PRO_LEN)-1)<<ETHMAC_PRO_POS))
#define ETHMAC_IFG                                              ETHMAC_IFG
#define ETHMAC_IFG_POS                                          (6U)
#define ETHMAC_IFG_LEN                                          (1U)
#define ETHMAC_IFG_MSK                                          (((1U<<ETHMAC_IFG_LEN)-1)<<ETHMAC_IFG_POS)
#define ETHMAC_IFG_UMSK                                         (~(((1U<<ETHMAC_IFG_LEN)-1)<<ETHMAC_IFG_POS))
#define ETHMAC_FULLD                                            ETHMAC_FULLD
#define ETHMAC_FULLD_POS                                        (10U)
#define ETHMAC_FULLD_LEN                                        (1U)
#define ETHMAC_FULLD_MSK                                        (((1U<<ETHMAC_FULLD_LEN)-1)<<ETHMAC_FULLD_POS)
#define ETHMAC_FULLD_UMSK                                       (~(((1U<<ETHMAC_FULLD_LEN)-1)<<ETHMAC_FULLD_POS))
#define ETHMAC_CRCEN                                            ETHMAC_CRCEN
#define ETHMAC_CRCEN_POS                                        (13U)
#define ETHMAC_CRCEN_LEN                                        (1U)
#define ETHMAC_CRCEN_MSK                                        (((1U<<ETHMAC_CRCEN_LEN)-1)<<ETHMAC_CRCEN_POS)
#define ETHMAC_CRCEN_UMSK                                       (~(((1U<<ETHMAC_CRCEN_LEN)-1)<<ETHMAC_CRCEN_POS))
#define ETHMAC_HUGEN                                            ETHMAC_HUGEN
#define ETHMAC_HUGEN_POS                                        (14U)
#define ETHMAC_HUGEN_LEN                                        (1U)
#define ETHMAC_HUGEN_MSK                                        (((1U<<ETHMAC_HUGEN_LEN)-1)<<ETHMAC_HUGEN_POS)
#define ETHMAC_HUGEN_UMSK                                       (~(((1U<<ETHMAC_HUGEN_LEN)-1)<<ETHMAC_HUGEN_POS))
#define ETHMAC_PAD                                              ETHMAC_PAD
#define ETHMAC_PAD_POS                                          (15U)
#define ETHMAC_PAD_LEN                                          (1U)
#define ETHMAC_PAD_MSK                                          (((1U<<ETHMAC_PAD_LEN)-1)<<ETHMAC_PAD_POS)
#define ETHMAC_PAD_UMSK                                         (~(((1U<<ETHMAC_PAD_LEN)-1)<<ETHMAC_PAD_POS))
#define ETHMAC_RECSMALL                                         ETHMAC_RECSMALL
#define ETHMAC_RECSMALL_POS                                     (16U)
#define ETHMAC_RECSMALL_LEN                                     (1U)
#define ETHMAC_RECSMALL_MSK                                     (((1U<<ETHMAC_RECSMALL_LEN)-1)<<ETHMAC_RECSMALL_POS)
#define ETHMAC_RECSMALL_UMSK                                    (~(((1U<<ETHMAC_RECSMALL_LEN)-1)<<ETHMAC_RECSMALL_POS))
#define ETHMAC_RMIIEN                                           ETHMAC_RMIIEN
#define ETHMAC_RMIIEN_POS                                       (17U)
#define ETHMAC_RMIIEN_LEN                                       (1U)
#define ETHMAC_RMIIEN_MSK                                       (((1U<<ETHMAC_RMIIEN_LEN)-1)<<ETHMAC_RMIIEN_POS)
#define ETHMAC_RMIIEN_UMSK                                      (~(((1U<<ETHMAC_RMIIEN_LEN)-1)<<ETHMAC_RMIIEN_POS))

