bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/ethmac_reg.h
/* 0x4 : INT_SOURCE */
#define ETHMAC_INT_SOURCE_OFFSET                                (0x4)
#define ETHMAC_TXB                                              ETHMAC_TXB
#define ETHMAC_TXB_POS                                          (0U)
#define ETHMAC_TXB_LEN                                          (1U)
#define ETHMAC_TXB_MSK                                          (((1U<<ETHMAC_TXB_LEN)-1)<<ETHMAC_TXB_POS)
#define ETHMAC_TXB_UMSK                                         (~(((1U<<ETHMAC_TXB_LEN)-1)<<ETHMAC_TXB_POS))
#define ETHMAC_TXE                                              ETHMAC_TXE
#define ETHMAC_TXE_POS                                          (1U)
#define ETHMAC_TXE_LEN                                          (1U)
#define ETHMAC_TXE_MSK                                          (((1U<<ETHMAC_TXE_LEN)-1)<<ETHMAC_TXE_POS)
#define ETHMAC_TXE_UMSK                                         (~(((1U<<ETHMAC_TXE_LEN)-1)<<ETHMAC_TXE_POS))
#define ETHMAC_RXB                                              ETHMAC_RXB
#define ETHMAC_RXB_POS                                          (2U)
#define ETHMAC_RXB_LEN                                          (1U)
#define ETHMAC_RXB_MSK                                          (((1U<<ETHMAC_RXB_LEN)-1)<<ETHMAC_RXB_POS)
#define ETHMAC_RXB_UMSK                                         (~(((1U<<ETHMAC_RXB_LEN)-1)<<ETHMAC_RXB_POS))
#define ETHMAC_RXE                                              ETHMAC_RXE
#define ETHMAC_RXE_POS                                          (3U)
#define ETHMAC_RXE_LEN                                          (1U)
#define ETHMAC_RXE_MSK                                          (((1U<<ETHMAC_RXE_LEN)-1)<<ETHMAC_RXE_POS)
#define ETHMAC_RXE_UMSK                                         (~(((1U<<ETHMAC_RXE_LEN)-1)<<ETHMAC_RXE_POS))
#define ETHMAC_BUSY                                             ETHMAC_BUSY
#define ETHMAC_BUSY_POS                                         (4U)
#define ETHMAC_BUSY_LEN                                         (1U)
#define ETHMAC_BUSY_MSK                                         (((1U<<ETHMAC_BUSY_LEN)-1)<<ETHMAC_BUSY_POS)
#define ETHMAC_BUSY_UMSK                                        (~(((1U<<ETHMAC_BUSY_LEN)-1)<<ETHMAC_BUSY_POS))
#define ETHMAC_TXC                                              ETHMAC_TXC
#define ETHMAC_TXC_POS                                          (5U)
#define ETHMAC_TXC_LEN                                          (1U)
#define ETHMAC_TXC_MSK                                          (((1U<<ETHMAC_TXC_LEN)-1)<<ETHMAC_TXC_POS)
#define ETHMAC_TXC_UMSK                                         (~(((1U<<ETHMAC_TXC_LEN)-1)<<ETHMAC_TXC_POS))
#define ETHMAC_RXC                                              ETHMAC_RXC
#define ETHMAC_RXC_POS                                          (6U)
#define ETHMAC_RXC_LEN                                          (1U)
#define ETHMAC_RXC_MSK                                          (((1U<<ETHMAC_RXC_LEN)-1)<<ETHMAC_RXC_POS)
#define ETHMAC_RXC_UMSK                                         (~(((1U<<ETHMAC_RXC_LEN)-1)<<ETHMAC_RXC_POS))

/* 0x8 : INT_MASK */
#define ETHMAC_INT_MASK_OFFSET                                  (0x8)
#define ETHMAC_TXB_M                                            ETHMAC_TXB_M
#define ETHMAC_TXB_M_POS                                        (0U)
#define ETHMAC_TXB_M_LEN                                        (1U)
#define ETHMAC_TXB_M_MSK                                        (((1U<<ETHMAC_TXB_M_LEN)-1)<<ETHMAC_TXB_M_POS)
#define ETHMAC_TXB_M_UMSK                                       (~(((1U<<ETHMAC_TXB_M_LEN)-1)<<ETHMAC_TXB_M_POS))
#define ETHMAC_TXE_M                                            ETHMAC_TXE_M
#define ETHMAC_TXE_M_POS                                        (1U)
#define ETHMAC_TXE_M_LEN                                        (1U)
#define ETHMAC_TXE_M_MSK                                        (((1U<<ETHMAC_TXE_M_LEN)-1)<<ETHMAC_TXE_M_POS)
#define ETHMAC_TXE_M_UMSK                                       (~(((1U<<ETHMAC_TXE_M_LEN)-1)<<ETHMAC_TXE_M_POS))
#define ETHMAC_RXB_M                                            ETHMAC_RXB_M
#define ETHMAC_RXB_M_POS                                        (2U)
#define ETHMAC_RXB_M_LEN                                        (1U)
#define ETHMAC_RXB_M_MSK                                        (((1U<<ETHMAC_RXB_M_LEN)-1)<<ETHMAC_RXB_M_POS)
#define ETHMAC_RXB_M_UMSK                                       (~(((1U<<ETHMAC_RXB_M_LEN)-1)<<ETHMAC_RXB_M_POS))
#define ETHMAC_RXE_M                                            ETHMAC_RXE_M
#define ETHMAC_RXE_M_POS                                        (3U)
#define ETHMAC_RXE_M_LEN                                        (1U)
#define ETHMAC_RXE_M_MSK                                        (((1U<<ETHMAC_RXE_M_LEN)-1)<<ETHMAC_RXE_M_POS)
#define ETHMAC_RXE_M_UMSK                                       (~(((1U<<ETHMAC_RXE_M_LEN)-1)<<ETHMAC_RXE_M_POS))
#define ETHMAC_BUSY_M                                           ETHMAC_BUSY_M
#define ETHMAC_BUSY_M_POS                                       (4U)
#define ETHMAC_BUSY_M_LEN                                       (1U)
#define ETHMAC_BUSY_M_MSK                                       (((1U<<ETHMAC_BUSY_M_LEN)-1)<<ETHMAC_BUSY_M_POS)
#define ETHMAC_BUSY_M_UMSK                                      (~(((1U<<ETHMAC_BUSY_M_LEN)-1)<<ETHMAC_BUSY_M_POS))
#define ETHMAC_TXC_M                                            ETHMAC_TXC_M
#define ETHMAC_TXC_M_POS                                        (5U)
#define ETHMAC_TXC_M_LEN                                        (1U)
#define ETHMAC_TXC_M_MSK                                        (((1U<<ETHMAC_TXC_M_LEN)-1)<<ETHMAC_TXC_M_POS)
#define ETHMAC_TXC_M_UMSK                                       (~(((1U<<ETHMAC_TXC_M_LEN)-1)<<ETHMAC_TXC_M_POS))
#define ETHMAC_RXC_M                                            ETHMAC_RXC_M
#define ETHMAC_RXC_M_POS                                        (6U)
#define ETHMAC_RXC_M_LEN                                        (1U)
#define ETHMAC_RXC_M_MSK                                        (((1U<<ETHMAC_RXC_M_LEN)-1)<<ETHMAC_RXC_M_POS)
#define ETHMAC_RXC_M_UMSK                                       (~(((1U<<ETHMAC_RXC_M_LEN)-1)<<ETHMAC_RXC_M_POS))

/* 0xC : IPGT */
#define ETHMAC_IPGT_OFFSET                                      (0xC)
#define ETHMAC_IPGT                                             ETHMAC_IPGT
#define ETHMAC_IPGT_POS                                         (0U)
#define ETHMAC_IPGT_LEN                                         (7U)
#define ETHMAC_IPGT_MSK                                         (((1U<<ETHMAC_IPGT_LEN)-1)<<ETHMAC_IPGT_POS)
#define ETHMAC_IPGT_UMSK                                        (~(((1U<<ETHMAC_IPGT_LEN)-1)<<ETHMAC_IPGT_POS))

/* 0x18 : PACKETLEN */
#define ETHMAC_PACKETLEN_OFFSET                                 (0x18)
#define ETHMAC_MAXFL                                            ETHMAC_MAXFL
#define ETHMAC_MAXFL_POS                                        (0U)
#define ETHMAC_MAXFL_LEN                                        (16U)
#define ETHMAC_MAXFL_MSK                                        (((1U<<ETHMAC_MAXFL_LEN)-1)<<ETHMAC_MAXFL_POS)
#define ETHMAC_MAXFL_UMSK                                       (~(((1U<<ETHMAC_MAXFL_LEN)-1)<<ETHMAC_MAXFL_POS))
#define ETHMAC_MINFL                                            ETHMAC_MINFL
#define ETHMAC_MINFL_POS                                        (16U)
#define ETHMAC_MINFL_LEN                                        (16U)
#define ETHMAC_MINFL_MSK                                        (((1U<<ETHMAC_MINFL_LEN)-1)<<ETHMAC_MINFL_POS)
#define ETHMAC_MINFL_UMSK                                       (~(((1U<<ETHMAC_MINFL_LEN)-1)<<ETHMAC_MINFL_POS))

