bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/ethmac_reg.h
/* 0x1C : COLLCONFIG */
#define ETHMAC_COLLCONFIG_OFFSET                                (0x1C)
#define ETHMAC_COLLVALID                                        ETHMAC_COLLVALID
#define ETHMAC_COLLVALID_POS                                    (0U)
#define ETHMAC_COLLVALID_LEN                                    (10U)
#define ETHMAC_COLLVALID_MSK                                    (((1U<<ETHMAC_COLLVALID_LEN)-1)<<ETHMAC_COLLVALID_POS)
#define ETHMAC_COLLVALID_UMSK                                   (~(((1U<<ETHMAC_COLLVALID_LEN)-1)<<ETHMAC_COLLVALID_POS))
#define ETHMAC_MAXRET                                           ETHMAC_MAXRET
#define ETHMAC_MAXRET_POS                                       (16U)
#define ETHMAC_MAXRET_LEN                                       (4U)
#define ETHMAC_MAXRET_MSK                                       (((1U<<ETHMAC_MAXRET_LEN)-1)<<ETHMAC_MAXRET_POS)
#define ETHMAC_MAXRET_UMSK                                      (~(((1U<<ETHMAC_MAXRET_LEN)-1)<<ETHMAC_MAXRET_POS))

/* 0x20 : TX_BD_NUM */
#define ETHMAC_TX_BD_NUM_OFFSET                                 (0x20)
#define ETHMAC_TXBDNUM                                          ETHMAC_TXBDNUM
#define ETHMAC_TXBDNUM_POS                                      (0U)
#define ETHMAC_TXBDNUM_LEN                                      (8U)
#define ETHMAC_TXBDNUM_MSK                                      (((1U<<ETHMAC_TXBDNUM_LEN)-1)<<ETHMAC_TXBDNUM_POS)
#define ETHMAC_TXBDNUM_UMSK                                     (~(((1U<<ETHMAC_TXBDNUM_LEN)-1)<<ETHMAC_TXBDNUM_POS))
#define ETHMAC_TXBDPTR                                          ETHMAC_TXBDPTR
#define ETHMAC_TXBDPTR_POS                                      (16U)
#define ETHMAC_TXBDPTR_LEN                                      (7U)
#define ETHMAC_TXBDPTR_MSK                                      (((1U<<ETHMAC_TXBDPTR_LEN)-1)<<ETHMAC_TXBDPTR_POS)
#define ETHMAC_TXBDPTR_UMSK                                     (~(((1U<<ETHMAC_TXBDPTR_LEN)-1)<<ETHMAC_TXBDPTR_POS))
#define ETHMAC_RXBDPTR                                          ETHMAC_RXBDPTR
#define ETHMAC_RXBDPTR_POS                                      (24U)
#define ETHMAC_RXBDPTR_LEN                                      (7U)
#define ETHMAC_RXBDPTR_MSK                                      (((1U<<ETHMAC_RXBDPTR_LEN)-1)<<ETHMAC_RXBDPTR_POS)
#define ETHMAC_RXBDPTR_UMSK                                     (~(((1U<<ETHMAC_RXBDPTR_LEN)-1)<<ETHMAC_RXBDPTR_POS))

/* 0x28 : MIIMODE */
#define ETHMAC_MIIMODE_OFFSET                                   (0x28)
#define ETHMAC_CLKDIV                                           ETHMAC_CLKDIV
#define ETHMAC_CLKDIV_POS                                       (0U)
#define ETHMAC_CLKDIV_LEN                                       (8U)
#define ETHMAC_CLKDIV_MSK                                       (((1U<<ETHMAC_CLKDIV_LEN)-1)<<ETHMAC_CLKDIV_POS)
#define ETHMAC_CLKDIV_UMSK                                      (~(((1U<<ETHMAC_CLKDIV_LEN)-1)<<ETHMAC_CLKDIV_POS))
#define ETHMAC_MIINOPRE                                         ETHMAC_MIINOPRE
#define ETHMAC_MIINOPRE_POS                                     (8U)
#define ETHMAC_MIINOPRE_LEN                                     (1U)
#define ETHMAC_MIINOPRE_MSK                                     (((1U<<ETHMAC_MIINOPRE_LEN)-1)<<ETHMAC_MIINOPRE_POS)
#define ETHMAC_MIINOPRE_UMSK                                    (~(((1U<<ETHMAC_MIINOPRE_LEN)-1)<<ETHMAC_MIINOPRE_POS))

/* 0x2C : MIICOMMAND */
#define ETHMAC_MIICOMMAND_OFFSET                                (0x2C)
#define ETHMAC_SCANSTAT                                         ETHMAC_SCANSTAT
#define ETHMAC_SCANSTAT_POS                                     (0U)
#define ETHMAC_SCANSTAT_LEN                                     (1U)
#define ETHMAC_SCANSTAT_MSK                                     (((1U<<ETHMAC_SCANSTAT_LEN)-1)<<ETHMAC_SCANSTAT_POS)
#define ETHMAC_SCANSTAT_UMSK                                    (~(((1U<<ETHMAC_SCANSTAT_LEN)-1)<<ETHMAC_SCANSTAT_POS))
#define ETHMAC_RSTAT                                            ETHMAC_RSTAT
#define ETHMAC_RSTAT_POS                                        (1U)
#define ETHMAC_RSTAT_LEN                                        (1U)
#define ETHMAC_RSTAT_MSK                                        (((1U<<ETHMAC_RSTAT_LEN)-1)<<ETHMAC_RSTAT_POS)
#define ETHMAC_RSTAT_UMSK                                       (~(((1U<<ETHMAC_RSTAT_LEN)-1)<<ETHMAC_RSTAT_POS))
#define ETHMAC_WCTRLDATA                                        ETHMAC_WCTRLDATA
#define ETHMAC_WCTRLDATA_POS                                    (2U)
#define ETHMAC_WCTRLDATA_LEN                                    (1U)
#define ETHMAC_WCTRLDATA_MSK                                    (((1U<<ETHMAC_WCTRLDATA_LEN)-1)<<ETHMAC_WCTRLDATA_POS)
#define ETHMAC_WCTRLDATA_UMSK                                   (~(((1U<<ETHMAC_WCTRLDATA_LEN)-1)<<ETHMAC_WCTRLDATA_POS))

/* 0x30 : MIIADDRESS */
#define ETHMAC_MIIADDRESS_OFFSET                                (0x30)
#define ETHMAC_FIAD                                             ETHMAC_FIAD
#define ETHMAC_FIAD_POS                                         (0U)
#define ETHMAC_FIAD_LEN                                         (5U)
#define ETHMAC_FIAD_MSK                                         (((1U<<ETHMAC_FIAD_LEN)-1)<<ETHMAC_FIAD_POS)
#define ETHMAC_FIAD_UMSK                                        (~(((1U<<ETHMAC_FIAD_LEN)-1)<<ETHMAC_FIAD_POS))
#define ETHMAC_RGAD                                             ETHMAC_RGAD
#define ETHMAC_RGAD_POS                                         (8U)
#define ETHMAC_RGAD_LEN                                         (5U)
#define ETHMAC_RGAD_MSK                                         (((1U<<ETHMAC_RGAD_LEN)-1)<<ETHMAC_RGAD_POS)
#define ETHMAC_RGAD_UMSK                                        (~(((1U<<ETHMAC_RGAD_LEN)-1)<<ETHMAC_RGAD_POS))

/* 0x34 : MIITX_DATA */
#define ETHMAC_MIITX_DATA_OFFSET                                (0x34)
#define ETHMAC_CTRLDATA                                         ETHMAC_CTRLDATA
#define ETHMAC_CTRLDATA_POS                                     (0U)
#define ETHMAC_CTRLDATA_LEN                                     (16U)
#define ETHMAC_CTRLDATA_MSK                                     (((1U<<ETHMAC_CTRLDATA_LEN)-1)<<ETHMAC_CTRLDATA_POS)
#define ETHMAC_CTRLDATA_UMSK                                    (~(((1U<<ETHMAC_CTRLDATA_LEN)-1)<<ETHMAC_CTRLDATA_POS))

/* 0x38 : MIIRX_DATA */
#define ETHMAC_MIIRX_DATA_OFFSET                                (0x38)
#define ETHMAC_PRSD                                             ETHMAC_PRSD
#define ETHMAC_PRSD_POS                                         (0U)
#define ETHMAC_PRSD_LEN                                         (16U)
#define ETHMAC_PRSD_MSK                                         (((1U<<ETHMAC_PRSD_LEN)-1)<<ETHMAC_PRSD_POS)
#define ETHMAC_PRSD_UMSK                                        (~(((1U<<ETHMAC_PRSD_LEN)-1)<<ETHMAC_PRSD_POS))

/* 0x3C : MIISTATUS */
#define ETHMAC_MIISTATUS_OFFSET                                 (0x3C)
#define ETHMAC_MIIM_LINKFAIL                                    ETHMAC_MIIM_LINKFAIL
#define ETHMAC_MIIM_LINKFAIL_POS                                (0U)
#define ETHMAC_MIIM_LINKFAIL_LEN                                (1U)
#define ETHMAC_MIIM_LINKFAIL_MSK                                (((1U<<ETHMAC_MIIM_LINKFAIL_LEN)-1)<<ETHMAC_MIIM_LINKFAIL_POS)
#define ETHMAC_MIIM_LINKFAIL_UMSK                               (~(((1U<<ETHMAC_MIIM_LINKFAIL_LEN)-1)<<ETHMAC_MIIM_LINKFAIL_POS))
#define ETHMAC_MIIM_BUSY                                        ETHMAC_MIIM_BUSY
#define ETHMAC_MIIM_BUSY_POS                                    (1U)
#define ETHMAC_MIIM_BUSY_LEN                                    (1U)
#define ETHMAC_MIIM_BUSY_MSK                                    (((1U<<ETHMAC_MIIM_BUSY_LEN)-1)<<ETHMAC_MIIM_BUSY_POS)
#define ETHMAC_MIIM_BUSY_UMSK                                   (~(((1U<<ETHMAC_MIIM_BUSY_LEN)-1)<<ETHMAC_MIIM_BUSY_POS))

/* 0x40 : MAC_ADDR0 */
#define ETHMAC_MAC_ADDR0_OFFSET                                 (0x40)
#define ETHMAC_MAC_B5                                           ETHMAC_MAC_B5
#define ETHMAC_MAC_B5_POS                                       (0U)
#define ETHMAC_MAC_B5_LEN                                       (8U)
#define ETHMAC_MAC_B5_MSK                                       (((1U<<ETHMAC_MAC_B5_LEN)-1)<<ETHMAC_MAC_B5_POS)
#define ETHMAC_MAC_B5_UMSK                                      (~(((1U<<ETHMAC_MAC_B5_LEN)-1)<<ETHMAC_MAC_B5_POS))
#define ETHMAC_MAC_B4                                           ETHMAC_MAC_B4
#define ETHMAC_MAC_B4_POS                                       (8U)
#define ETHMAC_MAC_B4_LEN                                       (8U)
#define ETHMAC_MAC_B4_MSK                                       (((1U<<ETHMAC_MAC_B4_LEN)-1)<<ETHMAC_MAC_B4_POS)
#define ETHMAC_MAC_B4_UMSK                                      (~(((1U<<ETHMAC_MAC_B4_LEN)-1)<<ETHMAC_MAC_B4_POS))
#define ETHMAC_MAC_B3                                           ETHMAC_MAC_B3
#define ETHMAC_MAC_B3_POS                                       (16U)
#define ETHMAC_MAC_B3_LEN                                       (8U)
#define ETHMAC_MAC_B3_MSK                                       (((1U<<ETHMAC_MAC_B3_LEN)-1)<<ETHMAC_MAC_B3_POS)
#define ETHMAC_MAC_B3_UMSK                                      (~(((1U<<ETHMAC_MAC_B3_LEN)-1)<<ETHMAC_MAC_B3_POS))
#define ETHMAC_MAC_B2                                           ETHMAC_MAC_B2
#define ETHMAC_MAC_B2_POS                                       (24U)
#define ETHMAC_MAC_B2_LEN                                       (8U)
#define ETHMAC_MAC_B2_MSK                                       (((1U<<ETHMAC_MAC_B2_LEN)-1)<<ETHMAC_MAC_B2_POS)
#define ETHMAC_MAC_B2_UMSK                                      (~(((1U<<ETHMAC_MAC_B2_LEN)-1)<<ETHMAC_MAC_B2_POS))

/* 0x44 : MAC_ADDR1 */
#define ETHMAC_MAC_ADDR1_OFFSET                                 (0x44)
#define ETHMAC_MAC_B1                                           ETHMAC_MAC_B1
#define ETHMAC_MAC_B1_POS                                       (0U)
#define ETHMAC_MAC_B1_LEN                                       (8U)
#define ETHMAC_MAC_B1_MSK                                       (((1U<<ETHMAC_MAC_B1_LEN)-1)<<ETHMAC_MAC_B1_POS)
#define ETHMAC_MAC_B1_UMSK                                      (~(((1U<<ETHMAC_MAC_B1_LEN)-1)<<ETHMAC_MAC_B1_POS))
#define ETHMAC_MAC_B0                                           ETHMAC_MAC_B0
#define ETHMAC_MAC_B0_POS                                       (8U)
#define ETHMAC_MAC_B0_LEN                                       (8U)
#define ETHMAC_MAC_B0_MSK                                       (((1U<<ETHMAC_MAC_B0_LEN)-1)<<ETHMAC_MAC_B0_POS)
#define ETHMAC_MAC_B0_UMSK                                      (~(((1U<<ETHMAC_MAC_B0_LEN)-1)<<ETHMAC_MAC_B0_POS))

/* 0x48 : HASH0_ADDR */
#define ETHMAC_HASH0_ADDR_OFFSET                                (0x48)
#define ETHMAC_HASH0                                            ETHMAC_HASH0
#define ETHMAC_HASH0_POS                                        (0U)
#define ETHMAC_HASH0_LEN                                        (32U)
#define ETHMAC_HASH0_MSK                                        (((1U<<ETHMAC_HASH0_LEN)-1)<<ETHMAC_HASH0_POS)
#define ETHMAC_HASH0_UMSK                                       (~(((1U<<ETHMAC_HASH0_LEN)-1)<<ETHMAC_HASH0_POS))

/* 0x4C : HASH1_ADDR */
#define ETHMAC_HASH1_ADDR_OFFSET                                (0x4C)
#define ETHMAC_HASH1                                            ETHMAC_HASH1
#define ETHMAC_HASH1_POS                                        (0U)
#define ETHMAC_HASH1_LEN                                        (32U)
#define ETHMAC_HASH1_MSK                                        (((1U<<ETHMAC_HASH1_LEN)-1)<<ETHMAC_HASH1_POS)
#define ETHMAC_HASH1_UMSK                                       (~(((1U<<ETHMAC_HASH1_LEN)-1)<<ETHMAC_HASH1_POS))

/* 0x50 : TXCTRL */
#define ETHMAC_TXCTRL_OFFSET                                    (0x50)
#define ETHMAC_TXPAUSETV                                        ETHMAC_TXPAUSETV
#define ETHMAC_TXPAUSETV_POS                                    (0U)
#define ETHMAC_TXPAUSETV_LEN                                    (16U)
#define ETHMAC_TXPAUSETV_MSK                                    (((1U<<ETHMAC_TXPAUSETV_LEN)-1)<<ETHMAC_TXPAUSETV_POS)
#define ETHMAC_TXPAUSETV_UMSK                                   (~(((1U<<ETHMAC_TXPAUSETV_LEN)-1)<<ETHMAC_TXPAUSETV_POS))
#define ETHMAC_TXPAUSERQ                                        ETHMAC_TXPAUSERQ
#define ETHMAC_TXPAUSERQ_POS                                    (16U)
#define ETHMAC_TXPAUSERQ_LEN                                    (1U)
#define ETHMAC_TXPAUSERQ_MSK                                    (((1U<<ETHMAC_TXPAUSERQ_LEN)-1)<<ETHMAC_TXPAUSERQ_POS)
#define ETHMAC_TXPAUSERQ_UMSK                                   (~(((1U<<ETHMAC_TXPAUSERQ_LEN)-1)<<ETHMAC_TXPAUSERQ_POS))


