bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/ethmac_reg.h
struct  ethmac_reg {
    /* 0x0 : MODE */
    union {
        struct {
            uint32_t RXEN                           :  1; /* [    0],        r/w,        0x0 */
            uint32_t TXEN                           :  1; /* [    1],        r/w,        0x0 */
            uint32_t NOPRE                          :  1; /* [    2],        r/w,        0x0 */
            uint32_t BRO                            :  1; /* [    3],        r/w,        0x0 */
            uint32_t rsvd_4                         :  1; /* [    4],       rsvd,        0x0 */
            uint32_t PRO                            :  1; /* [    5],        r/w,        0x0 */
            uint32_t IFG                            :  1; /* [    6],        r/w,        0x0 */
            uint32_t rsvd_9_7                       :  3; /* [ 9: 7],       rsvd,        0x0 */
            uint32_t FULLD                          :  1; /* [   10],        r/w,        0x0 */
            uint32_t rsvd_12_11                     :  2; /* [12:11],       rsvd,        0x0 */
            uint32_t CRCEN                          :  1; /* [   13],        r/w,        0x1 */
            uint32_t HUGEN                          :  1; /* [   14],        r/w,        0x0 */
            uint32_t PAD                            :  1; /* [   15],        r/w,        0x1 */
            uint32_t RECSMALL                       :  1; /* [   16],        r/w,        0x0 */
            uint32_t RMIIEN                         :  1; /* [   17],        r/w,        0x0 */
            uint32_t rsvd_31_18                     : 14; /* [31:18],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } MODE;

    /* 0x4 : INT_SOURCE */
    union {
        struct {
            uint32_t TXB                            :  1; /* [    0],        r/w,        0x0 */
            uint32_t TXE                            :  1; /* [    1],        r/w,        0x0 */
            uint32_t RXB                            :  1; /* [    2],        r/w,        0x0 */
            uint32_t RXE                            :  1; /* [    3],        r/w,        0x0 */
            uint32_t BUSY                           :  1; /* [    4],        r/w,        0x0 */
            uint32_t TXC                            :  1; /* [    5],        r/w,        0x0 */
            uint32_t RXC                            :  1; /* [    6],        r/w,        0x0 */
            uint32_t rsvd_31_7                      : 25; /* [31: 7],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } INT_SOURCE;

    /* 0x8 : INT_MASK */
    union {
        struct {
            uint32_t TXB_M                          :  1; /* [    0],        r/w,        0x0 */
            uint32_t TXE_M                          :  1; /* [    1],        r/w,        0x0 */
            uint32_t RXB_M                          :  1; /* [    2],        r/w,        0x0 */
            uint32_t RXE_M                          :  1; /* [    3],        r/w,        0x0 */
            uint32_t BUSY_M                         :  1; /* [    4],        r/w,        0x0 */
            uint32_t TXC_M                          :  1; /* [    5],        r/w,        0x0 */
            uint32_t RXC_M                          :  1; /* [    6],        r/w,        0x0 */
            uint32_t rsvd_31_7                      : 25; /* [31: 7],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } INT_MASK;

    /* 0xC : IPGT */
    union {
        struct {
            uint32_t IPGT                           :  7; /* [ 6: 0],        r/w,       0x18 */
            uint32_t reserved_7_31                  : 25; /* [31: 7],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } IPGT;

    /* 0x10  reserved */
    uint8_t RESERVED0x10[8];

    /* 0x18 : PACKETLEN */
    union {
        struct {
            uint32_t MAXFL                          : 16; /* [15: 0],        r/w,      0x600 */
            uint32_t MINFL                          : 16; /* [31:16],        r/w,       0x40 */
        }BF;
        uint32_t WORD;
    } PACKETLEN;

    /* 0x1C : COLLCONFIG */
    union {
        struct {
            uint32_t COLLVALID                      : 10; /* [ 9: 0],        r/w,       0x3f */
            uint32_t reserved_10_15                 :  6; /* [15:10],       rsvd,        0x0 */
            uint32_t MAXRET                         :  4; /* [19:16],        r/w,        0xf */
            uint32_t reserved_20_31                 : 12; /* [31:20],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } COLLCONFIG;

    /* 0x20 : TX_BD_NUM */
    union {
        struct {
            uint32_t TXBDNUM                        :  8; /* [ 7: 0],        r/w,       0x40 */
            uint32_t reserved_8_15                  :  8; /* [15: 8],       rsvd,        0x0 */
            uint32_t TXBDPTR                        :  7; /* [22:16],          r,        0x0 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t RXBDPTR                        :  7; /* [30:24],          r,        0x0 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TX_BD_NUM;

    /* 0x24  reserved */
    uint8_t RESERVED0x24[4];

    /* 0x28 : MIIMODE */
    union {
        struct {
            uint32_t CLKDIV                         :  8; /* [ 7: 0],        r/w,       0x64 */
            uint32_t MIINOPRE                       :  1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_31                  : 23; /* [31: 9],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } MIIMODE;

    /* 0x2C : MIICOMMAND */
    union {
        struct {
            uint32_t SCANSTAT                       :  1; /* [    0],        r/w,        0x0 */
            uint32_t RSTAT                          :  1; /* [    1],        r/w,        0x0 */
            uint32_t WCTRLDATA                      :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } MIICOMMAND;

    /* 0x30 : MIIADDRESS */
    union {
        struct {
            uint32_t FIAD                           :  5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t RGAD                           :  5; /* [12: 8],        r/w,        0x0 */
            uint32_t reserved_13_31                 : 19; /* [31:13],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } MIIADDRESS;

    /* 0x34 : MIITX_DATA */
    union {
        struct {
            uint32_t CTRLDATA                       : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } MIITX_DATA;

    /* 0x38 : MIIRX_DATA */
    union {
        struct {
            uint32_t PRSD                           : 16; /* [15: 0],          r,        0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } MIIRX_DATA;

    /* 0x3C : MIISTATUS */
    union {
        struct {
            uint32_t MIIM_LINKFAIL                  :  1; /* [    0],          r,        0x0 */
            uint32_t MIIM_BUSY                      :  1; /* [    1],          r,        0x0 */
            uint32_t reserved_2_31                  : 30; /* [31: 2],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } MIISTATUS;

    /* 0x40 : MAC_ADDR0 */
    union {
        struct {
            uint32_t MAC_B5                         :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t MAC_B4                         :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t MAC_B3                         :  8; /* [23:16],        r/w,        0x0 */
            uint32_t MAC_B2                         :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } MAC_ADDR0;

    /* 0x44 : MAC_ADDR1 */
    union {
        struct {
            uint32_t MAC_B1                         :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t MAC_B0                         :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } MAC_ADDR1;

    /* 0x48 : HASH0_ADDR */
    union {
        struct {
            uint32_t HASH0                          : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } HASH0_ADDR;

    /* 0x4C : HASH1_ADDR */
    union {
        struct {
            uint32_t HASH1                          : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } HASH1_ADDR;

    /* 0x50 : TXCTRL */
    union {
        struct {
            uint32_t TXPAUSETV                      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t TXPAUSERQ                      :  1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TXCTRL;

};

typedef volatile struct ethmac_reg ethmac_reg_t;


#endif  /* __ETHMAC_REG_H__ */
